# CoverOffsetTooLong Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..CoverOffsetTooLong Property
BuiltInFailures..::..FabricFailures Class See Also
---
Cover offset is greater than host thickness.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CoverOffsetTooLong { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CoverOffsetTooLong As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CoverOffsetTooLong {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace